// 1 Опишіть своїми словами як працює метод forEach.
// Метод forEach - це функція в JavaScript, яка дозволяє виконувати певний код для кожного елемента масиву. 
// Ця функція може приймати три параметри: поточний елемент, індекс поточного елемента та сам масив. 
// Для кожного елемента виконується ця функція і відповідні параметри передаються в неї.

// 2 Як очистити масив?

// let myArray = [1, 2, 3, 4, 5];
// // Методом splice
// myArray.splice(0, myArray.length);
// // Простим присвоєнням порожнього масиву
// myArray = [];

// 3 Як можна перевірити, що та чи інша змінна є масивом?
// Один з варіантів-використання методу Array.isArray(): цей метод дозволяє перевірити, чи є даний об'єкт масивом. 
// Він повертає true, якщо об'єкт є масивом, та false у протилежному випадку.

const arr = ['hello', 'world', 23, '23', null]

const filterBy = (arr, typeOfData) => arr.filter((elem) => typeof elem !== typeOfData);

const filteredArr = filterBy(arr, 'string');
console.log(filteredArr)

// Завдання
// Реалізувати функцію фільтру масиву за вказаним типом даних. Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

// Технічні вимоги:
// Написати функцію filterBy(), яка прийматиме 2 аргументи. Перший аргумент - масив, який міститиме будь-які дані, другий аргумент - тип даних.
// Функція повинна повернути новий масив, який міститиме всі дані, які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом. Тобто якщо передати масив ['hello', 'world', 23, '23', null], і другим аргументом передати 'string', то функція поверне масив [23, null].